app/controllers/api/boards_controller.rb

  def create
    @board = Board.new(board_params)
    @board.id = Board.last.id + 1
    @board.user_id = current_user.id
    if @board.save
---
INSERT INTO "boards" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "bad board"], ["user_id", 1], ["created_at", "2015-08-08 00:42:12.939893"], ["updated_at", "2015-08-08 00:42:12.939893"]]

  def show
    @board = Board.includes(lists: :cards).find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 6]]
SELECT "cards".* FROM "cards" WHERE "cards"."list_id" IN (1, 6, 11, 16, 21, 26, 31, 36, 41, 46)

  def update
    @board = Board.find(params[:id])
    @board.user_id = current_user.id
    if @board.update(board_params)
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "boards" SET "title" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["title", "good board"], ["updated_at", "2015-08-08 03:17:05.423250"], ["id", 6]]

  def destroy
    @board = Board.find(params[:id])
    @board.destroy;
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 6]]