app/controllers/api/lists_controller.rb

INSERT INTO "lists" ("board_id", "title", "ord", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["board_id", 1], ["title", "list 1"], ["ord", 1], ["created_at", "2015-08-10 22:46:12.631096"], ["updated_at", "2015-08-10 22:46:12.631096"]]
---
  def create
    @list = List.new(list_params)
    # list.board_id = params[:id]
    @list.id = List.last.id + 1
    if @list.save